
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Introdução · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../01-λ-calculus/01-λ-calculus.html" />
    
    
    <link rel="prev" href="../" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        <li class="header">Functional Programming in Javascript</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Sumário
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="00-introduction.html">
            
                <a href="00-introduction.html">
            
                    
                    Introdução
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../01-λ-calculus/01-λ-calculus.html">
            
                <a href="../01-λ-calculus/01-λ-calculus.html">
            
                    
                    Lambda Calculus
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../02-pure-functions/02-pure-functions.html">
            
                <a href="../02-pure-functions/02-pure-functions.html">
            
                    
                    Funções puras
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../03-currying-vs-partial-application/03-currying-vs-partial-application.html">
            
                <a href="../03-currying-vs-partial-application/03-currying-vs-partial-application.html">
            
                    
                    Currying & Parcial Application
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../04-immutability/04-immutability.html">
            
                <a href="../04-immutability/04-immutability.html">
            
                    
                    Imutabilidade
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="../05-declarative/05-declarative.html">
            
                <a href="../05-declarative/05-declarative.html">
            
                    
                    Programação Declarativa
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="../06-higher-order-functions/06-higher-order-functions.html">
            
                <a href="../06-higher-order-functions/06-higher-order-functions.html">
            
                    
                    Funções de Primeira Classe
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="../07-recursion/07-recursion.html">
            
                <a href="../07-recursion/07-recursion.html">
            
                    
                    Recursão
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="../08-composition-and-pipelines/08-composition-and-pipelines.html">
            
                <a href="../08-composition-and-pipelines/08-composition-and-pipelines.html">
            
                    
                    Composição de pipeline
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="../09-modules-and-async/09-modules-and-async.html">
            
                <a href="../09-modules-and-async/09-modules-and-async.html">
            
                    
                    Modulos, Async, contratos, error handling
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="../10-classes/10-classes.html">
            
                <a href="../10-classes/10-classes.html">
            
                    
                    Não usando classes
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="../11-tacit/11-tacit.html">
            
                <a href="../11-tacit/11-tacit.html">
            
                    
                    Programação tacita
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="../12-combinators/12-combinators.html">
            
                <a href="../12-combinators/12-combinators.html">
            
                    
                    Combinators
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="../13-category-theory/13-category-theory.html">
            
                <a href="../13-category-theory/13-category-theory.html">
            
                    
                    Teoria das categorias
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="../14-architecture/14-architecture.html">
            
                <a href="../14-architecture/14-architecture.html">
            
                    
                    Arquitetura Funcional
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="../15-langs/15-langs.html">
            
                <a href="../15-langs/15-langs.html">
            
                    
                    Linguagens que copilam para JS
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Introdução</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="introdu&#xE7;&#xE3;o">Introdu&#xE7;&#xE3;o</h1>
<h2 id="o-que-&#xE9;-fp">O que &#xE9; FP?</h2>
<p> N&#xE3;o &#xE9; atoa que o nome &#xE9; &quot;funcional&quot;. Uma linguagem funcional &#xE9; qualquer linguagem construida sobre <em>fun&#xE7;&#xF5;es</em> logicas, sendo baseadas em fun&#xE7;&#xF5;es matematicas no fluxo computacional(<a href="02-pure-functions/02-pure-functions.md">Igual na aula da quarta s&#xE9;rie!</a>).
A estrutura b&#xE1;sica destas linguagens de programa&#xE7;&#xE3;o vem da logica combinat&#xF3;ria e do calculo lambda, que vamos explicar no proximo capitulo.</p>
<p>A programa&#xE7;&#xE3;o funcional consiste em uma abordagem distinta da convencional programa&#xE7;&#xE3;o orientada a objetos para o desenvolvimento de aplica&#xE7;&#xF5;es e software.
Ressaltando que POO &#xE9; bastante &#xFA;til ainda hoje e seu ensino e seu uso ainda &#xE9;  bastante comum atualmente, reafirmamos a sua import&#xE2;ncia contudo salientando suas limita&#xE7;&#xF5;es. Podemos citar a implanta&#xE7;&#xE3;o da computa&#xE7;&#xE3;o paralela utilizando POO tende a ser demasiadamente custosa e dificil, por os estados podem ser alterados bem como sofrer efeitos colaterais.
Em programa&#xE7;&#xE3;o funcional n&#xE3;o &#xE9; permitido mutabilidade onde n&#xE3;o deveria existir. Fun&#xE7;&#xF5;es atuam como blocos de constru&#xE7;&#xE3;o.</p>
<p>Programar em uma linguagem funcional consiste em construir defini&#xE7;&#xF5;es e usar o computador para avaliar express&#xF5;es sendo o papel do programador construir fun&#xE7;&#xF5;es que obedecem princ&#xED;pios matem&#xE1;ticos para resolver um problema. Uma das principais caracter&#xED;sticas &#xE9; que se uma express&#xE3;o possui valores bem definidos, ent&#xE3;o a ordem em que o computador realiza essa avalia&#xE7;&#xE3;o n&#xE3;o deve afetar o resultado evitando assim um sistema de estados mut&#xE1;veis</p>
<p>Desde o seu surgimento, a programa&#xE7;&#xE3;o funcional vem sendo a queridinha dos aficionados pela ci&#xEA;ncia da computa&#xE7;&#xE3;o, valorizada pela sua pureza matem&#xE1;tica e natureza intrigante, manteve-se escondida em laborat&#xF3;rios de inform&#xE1;tica, empoeirados... ocupados por cientistas de dados e PhDs esperan&#xE7;osos.</p>
<p>Programa&#xE7;&#xE3;o funcional n&#xE3;o &#xE9; novidade e sequer modinha. O sistema formal do c&#xE1;lculo lambda foi desenvolvido na d&#xE9;cada de 30 pelo Allan Church para explorar a computabilidade para com defini&#xE7;&#xE3;o e aplica&#xE7;&#xE3;o de fun&#xE7;&#xF5;es e recurs&#xE3;o. Linguagens como LISP existem h&#xE1; mais de 60 anos.</p>
<p>Mas at&#xE9; poucos anos atr&#xE1;s computadores n&#xE3;o eram t&#xE3;o rapidos quanto hoje em dia e tinham bem pouco poder de processamento. Pra isso era importante utilizar linguagens que possibilitassem uma economia na mem&#xF3;ria e para isso linguagens imperativas que lidavam bem com a mem&#xF3;ria e faziam tarefas de forma procedural ficaram em alta.</p>
<p>Em um artigo publicado em 1965 na &quot;Electronics Maganize&quot;, pergunta-se ao Gordon E. Moore, diretor de pesquisa e desenvolvimento dos semicondutores Fairchild, como ele previa a ind&#xFA;stria nos pr&#xF3;ximos 10 anos e ele observou que o n&#xFA;mero de componentes em um circuito integrado havia dobrado em aproximadamente um ano, ele assumiu que a pr&#xF3;xima gera&#xE7;&#xE3;o de chips seria duas vezes mais r&#xE1;pida que a anterior em um per&#xED;odo de 18 meses, mas com o mesmo custo que os modelos de anterior, Moore especulou que esse viria a acontecer pelo menos nos pr&#xF3;ximos anos 10. </p>
<p><a href="https://banner2.kisspng.com/20180806/ku/kisspng-moore-s-law-intel-central-processing-unit-dennard-5b6862deaeace6.8292659815335677107155.jpg" target="_blank">https://banner2.kisspng.com/20180806/ku/kisspng-moore-s-law-intel-central-processing-unit-dennard-5b6862deaeace6.8292659815335677107155.jpg</a></p>
<p>A parte mais engra&#xE7;ada &#xE9; que esse padr&#xE3;o se repete at&#xE9; hoje, em o n&#xFA;mero de transistores aumentou exponencialmente e sua previs&#xE3;o foi popularizada e chamada de Lei de Moore. 
At&#xE9; que fisicamente um &#xFA;nico n&#xFA;cleo n&#xE3;o fosse fisicamente capaz de ter mais transistores sem que super-aquecesse. A solu&#xE7;&#xE3;o? Come&#xE7;a a era dos multi-nucleos.</p>
<p>Em contraste, a programa&#xE7;&#xE3;o imperativa consiste no uso de comandos que alteram os estados da mem&#xF3;ria, permite efeitos colaterais que podem alterar a execu&#xE7;&#xE3;o do programa e possuem sub rotinas em vez de fun&#xE7;&#xF5;es (no sentido matem&#xE1;tico). Por conta disso, diz-se que a programa&#xE7;&#xE3;o imperativa n&#xE3;o tem transpar&#xEA;ncia referencial, ou seja, um mesmo bloco de c&#xF3;digo pode ter dois resultados completamente diferentes. &#xC9; conveniente na estrutura&#xE7;&#xE3;o do software problemas de m&#xFA;ltipla comunica&#xE7;&#xE3;o de threads que ajudam a estruturar o c&#xF3;digo de forma a modelar a interface de usu&#xE1;rio como threads separadas e, assim, lidar da melhor forma com concorr&#xEA;ncia em tempo real. </p>
<p>De qualquer forma, atualmente processamento n&#xE3;o &#xE9; um problema, e faz sentido n&#xE3;o se importar tanto com o que acontece por de baixo dos panos e que linguagem estamos usando se queremos garantir uma abstra&#xE7;&#xE3;o que faz sentido. E por isso a programa&#xE7;&#xE3;o funcional tem sua segunda chance.
Al&#xE9;m disso, um modelo que faz sentido para concorr&#xEA;ncia e paralelismo com certeza &#xE9; a programa&#xE7;&#xE3;o funcional principalmente por suas vantagens em processamento.</p>
<p>De um tempo para c&#xE1; a programa&#xE7;&#xE3;o funcional vem regenerando-se e se mesclando em linguagens modernas, como Python, Julia, Java, Ruby, Clojure e - por &#xFA;ltimo mas n&#xE3;o menos importante - JavaScript.
Estas linguagens est&#xE3;o adquirindo elementos funcionais como express&#xF5;es lambdas. E cada vez mais linguagens modernas v&#xE3;o passar a funcionalidades de programa&#xE7;&#xE3;o funcional em breve ou j&#xE1; tem em seu core.</p>
<p>-- Voc&#xEA; disse, JavaScript? Aquela linguagem de script usada em programa&#xE7;&#xE3;o web?</p>
<p>-- Sim!</p>
<p>O JavaScript provou ser uma tecnologia importante, e que veio para ficar - por longo tempo. Basicamente porque &#xE9; Javascript que roda por tr&#xE1;s dos navegadores e devido a isso ela poder ser &quot;renascida&quot;, extendida, com novas estruturas providas por bibliotecas como o React, o jQuery e tantas mais. Isto est&#xE1; intimamente relacionado com a sua identidade como &quot;linguagem de programa&#xE7;&#xE3;o funcional&quot;. Compreendermos a aplica&#xE7;&#xE3;o de estruturas e algoritmos provenientes da programa&#xE7;&#xE3;o funcional nos ser&#xE1; &#xFA;til por longo tempo, independentemente de n&#xED;vel e/ou habilidades de quem a procura.</p>
<p>-- Por que javascript pode ser funcional?</p>
<p>O javascript assim como boa parte das linguagens, tem suporte a fun&#xE7;&#xF5;es de primeira ordem, ou seja, suas fun&#xE7;&#xF5;es podem ser passadas como argumento de outras fun&#xE7;&#xF5;es. Al&#xE9;m disso essas fun&#xE7;&#xF5;es podem ser compostas chamando umas as outras como <code>a(b())</code>. Javascript tem suporte a fun&#xE7;&#xF5;es an&#xF4;nimas e com &quot;Arrow Functions&quot; introduzidas na sua vers&#xE3;o 5, &#xE9; possivel tornar a linguagem cada vez mais funcional.</p>
<p>N&#xE3;o se engane no papo de paralelismo e concorr&#xEA;ncia: Javascript &#xE9; uma linguagem single thread.</p>
<ul>
<li>explicar single thread
Mesmo javascript nao sendo uma linguagem puramente funcional podemos utilizar alguns principios funcionais no nosso codigo</li>
</ul>
<p>-- Por que devo procur&#xE1;-la ent&#xE3;o?</p>
<p>A programa&#xE7;&#xE3;o funcional &#xE9; muito poderosa, robusta e elegante; extremamente &#xFA;til para a manipula&#xE7;&#xE3;o de grandes estruturas de dados. Podemos obter diversas vantagens com JavaScript &#x2014; uma linguagem de script do lado do cliente - se usada como o meio da aplica&#xE7;&#xE3;o do paradigma funcional em tarefas como, respostas ao dom, exibir de forma ordenada a resposta de uma Api e tantas outras das quais precisam os nossos modernos websites.</p>
<p>Enquanto OOP depente diretamente um estado mutavel, os metodos chamados devem mutar o estado do atual &quot;self&quot; ou &quot;this&quot;. A imutabilidade tamb&#xE9;m pode ser importante para garantir menos bugs.</p>
<p>Para melhores aplica&#xE7;&#xF5;es precisamos de maneiras simples e possiveis para tal e a programa&#xE7;&#xE3;o funcional te ajuda a escrever melhores programas and &quot;reason&quot;(n sei como traduzir) sobre os problemas que voc&#xEA; quer resolver.</p>
<p>Muitas pessoas comentam que aparenta dificil de primeira vista, mas &#xE9; pura quest&#xE3;o de adapta&#xE7;&#xE3;o. Quem tem um background de programa&#xE7;&#xE3;o procedural pode ter um pouco de dificuldade para se adaptar a um paradigma novo. Mas &#xE9; similar a aprender OOP de novo ou aprender programa&#xE7;&#xE3;o de logo.
Isso acontece pois voc&#xEA; j&#xE1; est&#xE1; familiar com muitos termos e formas de pensar, como por exemplo, utilizar estruturas como &quot;for&quot; ou &quot;while&quot; para fazer loops ou &quot;if&quot; ao inv&#xE9;s de pattern matchings. E da mesma forma, &#xE9; um periodo de tempo at&#xE9; pegar todos os jarg&#xF5;es e passar a ler de forma clara at&#xE9; entender seus fundamentos.</p>
<p>Uma das maiores vantagens s&#xE3;o a sua mantenabilidade</p>
<ul>
<li>Declaratividade s&#xE3;o uteis</li>
<li>Front end e estado imutavel.</li>
</ul>
<p>Neste livro, aprenderemos grande parte do necess&#xE1;rio sobre a programa&#xE7;&#xE3;o funcional com JavaScript, a emponderarmos aplica&#xE7;&#xF5;es web mediante o uso de &quot;JavaScript Funcional&quot;, a desbloquear seus poderes secretos permitindo-nos escrever programas mais curtos e poderosos, mais r&#xE1;pidos, pois num piscar de olhos s&#xE3;o transmitidos pela camada TCP devido ao &#xED;nfimo tamanho. Veremos a ideia central do paradigma funcional e como aplic&#xE1;-lo com o aux&#xED;lio do JavaScript, um passo-a-passo de problemas e precau&#xE7;&#xF5;es que podem surgir, e juntamente, a programa&#xE7;&#xE3;o orientada a objetos que ser&#xE1; o nosso aux&#xED;lio - &quot;aux&#xED;lio do aux&#xED;lio&quot;.</p>
<p>Este exemplo n&#xE3;o nos apresentou, mas nem de longe, o que a programa&#xE7;&#xE3;o funcional com JavaScript tem a oferecer. Veremos exemplos ainda mais poderosos da abordagem funcional.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../" class="navigation navigation-prev " aria-label="Previous page: Sumário">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../01-λ-calculus/01-λ-calculus.html" class="navigation navigation-next " aria-label="Next page: Lambda Calculus">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Introdução","level":"1.2","depth":1,"next":{"title":"Lambda Calculus","level":"1.3","depth":1,"path":"01-λ-calculus/01-λ-calculus.md","ref":"01-λ-calculus/01-λ-calculus.md","articles":[]},"previous":{"title":"Sumário","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"00-introduction/00-introduction.md","mtime":"2019-03-02T20:02:52.611Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2019-03-02T20:03:14.834Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

